pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                    File 'pic18_convert_relatives.cpp'                     *
//                        Generated by version 2.5.0                         *
//                      august 1st, 2013, at 15h7'42"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_convert_relatives.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_convert_relatives.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*

cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (const GALGAS_lstring & inKey,
                                                                                                                                                            const GALGAS_uint & in_mRoutineAddress
                                                                                                                                                            COMMA_LOCATION_ARGS) :
cMapElement (inKey COMMA_THERE),
mAttribute_mRoutineAddress (in_mRoutineAddress) {
}

//---------------------------------------------------------------------------*

bool cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mRoutineAddress.isValid () ;
}

//---------------------------------------------------------------------------*

cMapElement * cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::copy (void) {
  cMapElement * result = NULL ;
  macroMyNew (result, cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (mAttribute_lkey, mAttribute_mRoutineAddress COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

void cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::description (C_String & ioString, const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "mRoutineAddress" ":" ;
  mAttribute_mRoutineAddress.description (ioString, inIndentation) ;
}

//---------------------------------------------------------------------------*

typeComparisonResult cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::compare (const cCollectionElement * inOperand) const {
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * operand = (cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) inOperand ;
  typeComparisonResult result = mAttribute_lkey.objectCompare (operand->mAttribute_lkey) ;
  if (kOperandEqual == result) {
    result = mAttribute_mRoutineAddress.objectCompare (operand->mAttribute_mRoutineAddress) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (void) :
AC_GALGAS_map () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & inSource) :
AC_GALGAS_map (inSource) {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::operator = (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & inSource) {
  * ((AC_GALGAS_map *) this) = inSource ;
  return * this ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::constructor_emptyMap (LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives result ;
  result.makeNewEmptyMap (THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::constructor_mapWithMapToOverride (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & inMapToOverride
                                                                                                                                                                                   COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives result ;
  result.makeNewEmptyMapWithMapToOverride (inMapToOverride COMMA_THERE) ;
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::reader_overriddenMap (C_Compiler * inCompiler
                                                                                                                                                                       COMMA_LOCATION_ARGS) const {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives result ;
  getOverridenMap (result, inCompiler COMMA_THERE) ;
  return result ;
}
//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::modifier_insertKey (GALGAS_lstring inKey,
                                                                                                  GALGAS_uint inArgument0,
                                                                                                  C_Compiler * inCompiler
                                                                                                  COMMA_LOCATION_ARGS) {
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * p = NULL ;
  macroMyNew (p, cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (inKey, inArgument0 COMMA_HERE)) ;
  capCollectionElement attributes ;
  attributes.setPointer (p) ;
  macroDetachSharedObject (p) ;
  const char * kInsertErrorMessage = "the '%K' label is already declared in %L" ;
  const char * kShadowErrorMessage = "" ;
  performInsert (attributes, inCompiler, kInsertErrorMessage, kShadowErrorMessage COMMA_THERE) ;
}

//---------------------------------------------------------------------------*

const char * kSearchErrorMessage_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_searchKey = "the '%K' label is not declared" ;

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::method_searchKey (GALGAS_lstring inKey,
                                                                                                GALGAS_uint & outArgument0,
                                                                                                C_Compiler * inCompiler
                                                                                                COMMA_LOCATION_ARGS) const {
  const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * p = (const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) performSearch (inKey,
                                                                                                                                                                                                   inCompiler,
                                                                                                                                                                                                   kSearchErrorMessage_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_searchKey
                                                                                                                                                                                                   COMMA_THERE) ;
  if (NULL == p) {
    outArgument0.drop () ;
  }else{
    macroValidSharedObject (p, const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives) ;
    outArgument0 = p->mAttribute_mRoutineAddress ;
  }
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::reader_mRoutineAddressForKey (const GALGAS_string & inKey,
                                                                                                                   C_Compiler * inCompiler
                                                                                                                   COMMA_LOCATION_ARGS) const {
  const cCollectionElement * attributes = searchForReadingAttribute (inKey, inCompiler COMMA_THERE) ;
  const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * p = (const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) attributes ;
  GALGAS_uint result ;
  if (NULL != p) {
    macroValidSharedObject (p, const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives) ;
    result = p->mAttribute_mRoutineAddress ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

