pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
void GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::modifier_setMRoutineAddressForKey (GALGAS_uint inAttributeValue,
                                                                                                                 GALGAS_string inKey,
                                                                                                                 C_Compiler * inCompiler
                                                                                                                 COMMA_LOCATION_ARGS) {
  cCollectionElement * attributes = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * p = (cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) attributes ;
  if (NULL != p) {
    macroValidSharedObject (p, cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives) ;
    p->mAttribute_mRoutineAddress = inAttributeValue ;
  }
}

//---------------------------------------------------------------------------*

cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                                                                                                                  const GALGAS_string & inKey
                                                                                                                                                                                                  COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler COMMA_THERE) ;
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * result = (cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) p ;
  macroNullOrValidSharedObject (result, cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives) ;
  return result ;
}

//---------------------------------------------------------------------------*

cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                                                                                                                     const GALGAS_lstring & inKey
                                                                                                                                                                                                     COMMA_LOCATION_ARGS) {
  cMapElement * p = searchForReadWriteAttribute (inKey, inCompiler, kSearchErrorMessage_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_searchKey COMMA_THERE) ;
  cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * result = (cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) p ;
  macroNullOrValidSharedObject (result, cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives) ;
  return result ;
}

//---------------------------------------------------------------------------*

cEnumerator_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::cEnumerator_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & inEnumeratedObject,
                                                                                                                                                            const typeEnumerationOrder inOrder) :
cGenericAbstractEnumerator () {
  inEnumeratedObject.populateEnumerationArray (mEnumerationArray, inOrder) ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element cEnumerator_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::current (LOCATION_ARGS) const {
  const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * p = (const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives) ;
  return GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (p->mAttribute_lkey, p->mAttribute_mRoutineAddress) ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring cEnumerator_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::current_lkey (LOCATION_ARGS) const {
  const cMapElement * p = (const cMapElement *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement) ;
  return p->mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint cEnumerator_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::current_mRoutineAddress (LOCATION_ARGS) const {
  const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * p = (const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives) ;
  return p->mAttribute_mRoutineAddress ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//        @pic18_intermediate_symbolTableForConvertingRelatives type         *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives ("pic18_intermediate_symbolTableForConvertingRelatives",
                                                                                         NULL) ;

//---------------------------------------------------------------------------*

