pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::extractObject (const GALGAS_object & inObject,
                                                                                                                                                                C_Compiler * inCompiler
                                                                                                                                                                COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * p = (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives *> (p)) {
      result = *p ;
    }else{
      inCompiler->castError ("pic18_intermediate_symbolTableForConvertingRelatives", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//  Routine 'pic18_intermediate_convertRelativeBranchsToAbsoluteWhenNeeded'  *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_pic_31__38__5F_intermediate_5F_convertRelativeBranchsToAbsoluteWhenNeeded (GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                        C_Compiler * inCompiler
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (523)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (523)) COMMA_SOURCE_FILE_AT_LINE (523)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*").operator_concat (GALGAS_string ("CONVERT RELATIVES").reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 77U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (524)) COMMA_SOURCE_FILE_AT_LINE (524)).operator_concat (GALGAS_string ("*\n") COMMA_SOURCE_FILE_AT_LINE (524)) COMMA_SOURCE_FILE_AT_LINE (524)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (525)).operator_concat (GALGAS_string ("\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (525)) COMMA_SOURCE_FILE_AT_LINE (525)) ;
  GALGAS_bool var_relativeBranchOverflow = GALGAS_bool (true) ;
  GALGAS_uint var_iteration = GALGAS_uint ((PMUInt32) 0U) ;
  if (ioArgument_ioGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (528)).isValid ()) {
    PMUInt32 variant_22441 = ioArgument_ioGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (528)).uintValue () ;
    bool loop_22441 = true ;
    while (loop_22441) {
      loop_22441 = var_relativeBranchOverflow.isValid () ;
      if (loop_22441) {
        loop_22441 = var_relativeBranchOverflow.boolValue () ;
      }
      if (loop_22441 && (0 == variant_22441)) {
        loop_22441 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (528)) ;
      }
      if (loop_22441) {
        variant_22441 -- ;
        var_relativeBranchOverflow = GALGAS_bool (false) ;
        var_iteration.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (532)) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Pass ").operator_concat (var_iteration.reader_string (SOURCE_FILE_AT_LINE (533)) COMMA_SOURCE_FILE_AT_LINE (533)).operator_concat (GALGAS_string (":\n") COMMA_SOURCE_FILE_AT_LINE (533)) COMMA_SOURCE_FILE_AT_LINE (533)) ;
        GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives var_symbolTable = GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives::constructor_emptyMap (SOURCE_FILE_AT_LINE (535)) ;
        GALGAS_uint var_currentAddress = GALGAS_uint ((PMUInt32) 0U) ;
        cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_22856 (ioArgument_ioGeneratedInstructionList, kEnumeration_up) ;
        while (enumerator_22856.hasCurrentObject ()) {
          callCategoryMethod_defineLabelAtAddress ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_22856.current_mInstruction (HERE).ptr (), var_symbolTable, var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (538)) ;
          enumerator_22856.gotoNextObject () ;
        }
        GALGAS_uint var_lastAddressForFirstPass = var_currentAddress ;
        var_currentAddress = GALGAS_uint ((PMUInt32) 0U) ;
        cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_23137 (ioArgument_ioGeneratedInstructionList, kEnumeration_up) ;
        GALGAS_uint index_23131 ((PMUInt32) 0) ;
        while (enumerator_23137.hasCurrentObject ()) {
          callCategoryMethod_checkRelativeBranch ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_23137.current_mInstruction (HERE).ptr (), var_symbolTable, var_currentAddress, var_relativeBranchOverflow, ioArgument_ioGeneratedInstructionList, index_23131, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (544)) ;
          var_currentAddress = var_currentAddress.add_operation (callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_23137.current_mInstruction (HERE).ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (545)), inCompiler COMMA_SOURCE_FILE_AT_LINE (545)) ;
          enumerator_23137.gotoNextObject () ;
          index_23131.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (543)) ;
        }
        const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_lastAddressForFirstPass.objectCompare (var_currentAddress)).boolEnum () ;
        if (kBoolTrue == test_0) {
          inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("Internal second pass error: the last address gets ").operator_concat (var_currentAddress.reader_hexString (SOURCE_FILE_AT_LINE (548)) COMMA_SOURCE_FILE_AT_LINE (548)).operator_concat (GALGAS_string (" value when checking relative branches, while it gets ") COMMA_SOURCE_FILE_AT_LINE (549)).operator_concat (var_lastAddressForFirstPass.reader_hexString (SOURCE_FILE_AT_LINE (550)) COMMA_SOURCE_FILE_AT_LINE (550)).operator_concat (GALGAS_string (" value when computing routine map") COMMA_SOURCE_FILE_AT_LINE (550)) COMMA_SOURCE_FILE_AT_LINE (548)) ;
        }
        const enumGalgasBool test_1 = var_relativeBranchOverflow.operator_not (SOURCE_FILE_AT_LINE (552)).boolEnum () ;
        if (kBoolTrue == test_1) {
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  No relative to convert\n"
            "\n") COMMA_SOURCE_FILE_AT_LINE (553)) ;
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Program size: ").operator_concat (var_currentAddress.reader_string (SOURCE_FILE_AT_LINE (554)) COMMA_SOURCE_FILE_AT_LINE (554)).operator_concat (GALGAS_string (" bytes\n"
            "\n") COMMA_SOURCE_FILE_AT_LINE (554)) COMMA_SOURCE_FILE_AT_LINE (554)) ;
        }
      }
    }
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//  Category method '@pic18_intermediate_instruction defineLabelAtAddress'   *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_defineLabelAtAddress (const PMSInt32 inClassIndex,
                                               categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_defineLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                              GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & io_ioRoutineSymbolTable,
                                              GALGAS_uint & io_ioAddress,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioRoutineSymbolTable, io_ioAddress, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                            GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & /* ioArgument_ioRoutineSymbolTable */,
                                                                                            GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                            C_Compiler * /* inCompiler */
                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress (void) {
  enterCategoryMethod_defineLabelAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress) ;
}

//---------------------------------------------------------------------------*

