pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_defineLabelAtAddress (void) {
  enterCategoryMethod_defineLabelAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_defineLabelAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_actualInstruction_defineLabelAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_defineLabelAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_word defineLabelAtAddress' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_word_defineLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                     GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & /* ioArgument_ioRoutineSymbolTable */,
                                                                                     GALGAS_uint & ioArgument_ioAddress,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_word * object = (const cPtr_pic_31__38__5F_intermediate_5F_word *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_word) ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_word temp_0 = object ;
  ioArgument_ioAddress = ioArgument_ioAddress.add_operation (callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_word *) temp_0.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (61)), inCompiler COMMA_SOURCE_FILE_AT_LINE (61)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_defineLabelAtAddress (void) {
  enterCategoryMethod_defineLabelAtAddress (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_word.mSlotID,
                                            categoryMethod_pic_31__38__5F_intermediate_5F_word_defineLabelAtAddress) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_word_defineLabelAtAddress (defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_defineLabelAtAddress, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@pic18_intermediate_instruction checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_checkRelativeBranch (const PMSInt32 inClassIndex,
                                              categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch (NULL,
                                                                                           freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                             const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constin_inRoutineSymbolTable,
                                             GALGAS_uint & io_ioAddress,
                                             GALGAS_bool & io_ioRelativeBranchOverflow,
                                             GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                             const GALGAS_uint constin_inIndex,
                                             GALGAS_string & io_ioListFileContents,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) {
//--- Drop output arguments
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inRoutineSymbolTable, io_ioAddress, io_ioRelativeBranchOverflow, io_ioGeneratedInstructionList, constin_inIndex, io_ioListFileContents, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_NULL checkRelativeBranch' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_NULL_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                    const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives /* constinArgument_inRoutineSymbolTable */,
                                                                                    GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                    GALGAS_bool & /* ioArgument_ioRelativeBranchOverflow */,
                                                                                    GALGAS_pic_31__38__5F_intermediate_5F_instructionList & /* ioArgument_ioGeneratedInstructionList */,
                                                                                    const GALGAS_uint /* constinArgument_inIndex */,
                                                                                    GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                    C_Compiler * /* inCompiler */
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

