pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_NULL_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_NULL_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_NULL_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_MOV_LABEL_W checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                 const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives /* constinArgument_inRoutineSymbolTable */,
                                                                                                 GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                 GALGAS_bool & /* ioArgument_ioRelativeBranchOverflow */,
                                                                                                 GALGAS_pic_31__38__5F_intermediate_5F_instructionList & /* ioArgument_ioGeneratedInstructionList */,
                                                                                                 const GALGAS_uint /* constinArgument_inIndex */,
                                                                                                 GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                                 C_Compiler * /* inCompiler */
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_word checkRelativeBranch' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_word_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                    const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives /* constinArgument_inRoutineSymbolTable */,
                                                                                    GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                    GALGAS_bool & /* ioArgument_ioRelativeBranchOverflow */,
                                                                                    GALGAS_pic_31__38__5F_intermediate_5F_instructionList & /* ioArgument_ioGeneratedInstructionList */,
                                                                                    const GALGAS_uint /* constinArgument_inIndex */,
                                                                                    GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                    C_Compiler * /* inCompiler */
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_word.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_word_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_word_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_word_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_actualInstruction checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                 const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives /* constinArgument_inRoutineSymbolTable */,
                                                                                                 GALGAS_uint & /* ioArgument_ioAddress */,
                                                                                                 GALGAS_bool & /* ioArgument_ioRelativeBranchOverflow */,
                                                                                                 GALGAS_pic_31__38__5F_intermediate_5F_instructionList & /* ioArgument_ioGeneratedInstructionList */,
                                                                                                 const GALGAS_uint /* constinArgument_inIndex */,
                                                                                                 GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                                 C_Compiler * /* inCompiler */
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_actualInstruction_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_actualInstruction_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_ORG checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                             const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives /* constinArgument_inRoutineSymbolTable */,
                                                                                             GALGAS_uint & ioArgument_ioAddress,
                                                                                             GALGAS_bool & /* ioArgument_ioRelativeBranchOverflow */,
                                                                                             GALGAS_pic_31__38__5F_intermediate_5F_instructionList & /* ioArgument_ioGeneratedInstructionList */,
                                                                                             const GALGAS_uint /* constinArgument_inIndex */,
                                                                                             GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                             C_Compiler * /* inCompiler */
                                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG) ;
  ioArgument_ioAddress = object->mAttribute_mOrigin ;
}
//---------------------------------------------------------------------------*

