pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_conditionalBranch checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                                                GALGAS_uint & ioArgument_ioAddress,
                                                                                                                GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                                                GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                                const GALGAS_uint constinArgument_inIndex,
                                                                                                                GALGAS_string & ioArgument_ioListFileContents,
                                                                                                                C_Compiler * inCompiler
                                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  if (object->mAttribute_mBranchMode.isValid ()) {
    switch (object->mAttribute_mBranchMode.enumValue ()) {
    case GALGAS_condionalBranchMode::kNotBuilt:
      break ;
    case GALGAS_condionalBranchMode::kEnum_native: {
      GALGAS_uint var_targetAddress ;
      constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (154)) ;
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (155)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (155)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (155)), inCompiler COMMA_SOURCE_FILE_AT_LINE (155)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (155)) ;
      const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 127L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 128L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (156)))) COMMA_SOURCE_FILE_AT_LINE (156)).boolEnum () ;
      if (kBoolTrue == test_0) {
        inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("displacement (").operator_concat (var_displacement.reader_string (SOURCE_FILE_AT_LINE (157)) COMMA_SOURCE_FILE_AT_LINE (157)).operator_concat (GALGAS_string (") too large for Bcc instruction (limited to [-128, 127])") COMMA_SOURCE_FILE_AT_LINE (157)) COMMA_SOURCE_FILE_AT_LINE (157)) ;
      }
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicNative: {
      GALGAS_uint var_targetAddress ;
      constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (161)) ;
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (162)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (162)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (162)), inCompiler COMMA_SOURCE_FILE_AT_LINE (162)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (162)) ;
      const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 127L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 128L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (163)))) COMMA_SOURCE_FILE_AT_LINE (163)).boolEnum () ;
      if (kBoolTrue == test_1) {
        ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (165)) COMMA_SOURCE_FILE_AT_LINE (165)).operator_concat (GALGAS_string (":  native Bcc overflow, converted to Bcc with BRA\n") COMMA_SOURCE_FILE_AT_LINE (165)) COMMA_SOURCE_FILE_AT_LINE (165)) ;
        GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::constructor_new (object->mAttribute_mInstructionLocation, GALGAS_condionalBranchMode::constructor_ipicBRA (SOURCE_FILE_AT_LINE (168)), object->mAttribute_mConditionalBranch, object->mAttribute_mTargetLabel COMMA_SOURCE_FILE_AT_LINE (166)) ;
        {
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (172)) ;
        }
      }
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicBRA: {
      GALGAS_uint var_targetAddress ;
      constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (176)) ;
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (177)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (177)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (177)), inCompiler COMMA_SOURCE_FILE_AT_LINE (177)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (177)) ;
      const enumGalgasBool test_2 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (178)))) COMMA_SOURCE_FILE_AT_LINE (178)).boolEnum () ;
      if (kBoolTrue == test_2) {
        ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (180)) COMMA_SOURCE_FILE_AT_LINE (180)).operator_concat (GALGAS_string (":  Bcc with BRA overflow, converted to Bcc with GOTO\n") COMMA_SOURCE_FILE_AT_LINE (180)) COMMA_SOURCE_FILE_AT_LINE (180)) ;
        GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::constructor_new (object->mAttribute_mInstructionLocation, GALGAS_condionalBranchMode::constructor_ipicGOTO (SOURCE_FILE_AT_LINE (183)), object->mAttribute_mConditionalBranch, object->mAttribute_mTargetLabel COMMA_SOURCE_FILE_AT_LINE (181)) ;
        {
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (187)) ;
        }
      }
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicGOTO: {
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_registerComparisonCondition checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                           const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                                           GALGAS_uint & ioArgument_ioAddress,
                                                                                                           GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                                           GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                           const GALGAS_uint constinArgument_inIndex,
                                                                                                           GALGAS_string & ioArgument_ioListFileContents,
                                                                                                           C_Compiler * inCompiler
                                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  GALGAS_bool var_uses ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition temp_0 = object ;
  callCategoryMethod_usesIntermediateBRA ((const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) temp_0.ptr (), var_uses, inCompiler COMMA_SOURCE_FILE_AT_LINE (236)) ;
  const enumGalgasBool test_1 = object->mAttribute_mUsesBra.boolEnum () ;
  if (kBoolTrue == test_1) {
    GALGAS_uint var_BRAaddress = ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (238)) ;
    const enumGalgasBool test_2 = var_uses.boolEnum () ;
    if (kBoolTrue == test_2) {
      var_BRAaddress = var_BRAaddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (240)) ;
    }
    GALGAS_uint var_targetAddress ;
    constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (243)) ;
    GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (244)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (244)).substract_operation (var_BRAaddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (244)), inCompiler COMMA_SOURCE_FILE_AT_LINE (244)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (244)) ;
    const enumGalgasBool test_3 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (245)))) COMMA_SOURCE_FILE_AT_LINE (245)).boolEnum () ;
    if (kBoolTrue == test_3) {
      ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (247)) COMMA_SOURCE_FILE_AT_LINE (247)).operator_concat (GALGAS_string (":  JUMP with BRA overflow, converted to JUMP with GOTO\n") COMMA_SOURCE_FILE_AT_LINE (247)) COMMA_SOURCE_FILE_AT_LINE (247)) ;
      GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mRegisterDescription, object->mAttribute_mTargetLabel, object->mAttribute_mComparison, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (248)) ;
      {
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (255)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_incDecRegisterInCondition checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                                         GALGAS_uint & ioArgument_ioAddress,
                                                                                                         GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                                         GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                         const GALGAS_uint constinArgument_inIndex,
                                                                                                         GALGAS_string & ioArgument_ioListFileContents,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesBra.boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_uint var_BRAaddress = ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (271)) ;
    GALGAS_uint var_targetAddress ;
    constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (273)) ;
    GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (274)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (274)).substract_operation (var_BRAaddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (274)), inCompiler COMMA_SOURCE_FILE_AT_LINE (274)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (274)) ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (275)))) COMMA_SOURCE_FILE_AT_LINE (275)).boolEnum () ;
    if (kBoolTrue == test_1) {
      ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (277)) COMMA_SOURCE_FILE_AT_LINE (277)).operator_concat (GALGAS_string (":  JUMP with BRA overflow, converted to JUMP with GOTO\n") COMMA_SOURCE_FILE_AT_LINE (277)) COMMA_SOURCE_FILE_AT_LINE (277)) ;
      GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mRegisterDescription, object->mAttribute_mTargetLabel, object->mAttribute_mIncrement, object->mAttribute_m_5F_W_5F_isDestination, object->mAttribute_mBranchIfZero, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (278)) ;
      {
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (287)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

