pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_JUMP checkRelativeBranch' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                    const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                    GALGAS_uint & ioArgument_ioAddress,
                                                                                    GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                    GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                    const GALGAS_uint constinArgument_inIndex,
                                                                                    GALGAS_string & ioArgument_ioListFileContents,
                                                                                    C_Compiler * inCompiler
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = (const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: {
      GALGAS_uint var_targetAddress ;
      constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (305)) ;
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (306)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (306)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (306)), inCompiler COMMA_SOURCE_FILE_AT_LINE (306)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (306)) ;
      const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (307)))) COMMA_SOURCE_FILE_AT_LINE (307)).boolEnum () ;
      if (kBoolTrue == test_0) {
        ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (309)) COMMA_SOURCE_FILE_AT_LINE (309)).operator_concat (GALGAS_string (":  JUMP with BRA overflow, converted to JUMP with GOTO\n") COMMA_SOURCE_FILE_AT_LINE (309)) COMMA_SOURCE_FILE_AT_LINE (309)) ;
        GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_JUMP::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabel, GALGAS_jumpInstructionKind::constructor_ipicAbsolute (SOURCE_FILE_AT_LINE (313)) COMMA_SOURCE_FILE_AT_LINE (310)) ;
        {
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (315)) ;
        }
      }
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: {
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_relative: {
      GALGAS_uint var_targetAddress ;
      constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (320)) ;
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (321)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (321)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (321)), inCompiler COMMA_SOURCE_FILE_AT_LINE (321)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (321)) ;
      const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (322)))) COMMA_SOURCE_FILE_AT_LINE (322)).boolEnum () ;
      if (kBoolTrue == test_1) {
        inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("displacement (").operator_concat (var_displacement.reader_string (SOURCE_FILE_AT_LINE (323)) COMMA_SOURCE_FILE_AT_LINE (323)).operator_concat (GALGAS_string (") too large for BRA instruction (limited to [-1024, 1023])") COMMA_SOURCE_FILE_AT_LINE (323)) COMMA_SOURCE_FILE_AT_LINE (323)) ;
      }
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_absolute: {
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JUMP_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_JSR checkRelativeBranch'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JSR_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                   const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                   GALGAS_uint & ioArgument_ioAddress,
                                                                                   GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                   GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                   const GALGAS_uint constinArgument_inIndex,
                                                                                   GALGAS_string & ioArgument_ioListFileContents,
                                                                                   C_Compiler * inCompiler
                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: {
      GALGAS_uint var_targetAddress ;
      constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (342)) ;
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (343)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (343)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (343)), inCompiler COMMA_SOURCE_FILE_AT_LINE (343)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (343)) ;
      const enumGalgasBool test_0 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (344)))) COMMA_SOURCE_FILE_AT_LINE (344)).boolEnum () ;
      if (kBoolTrue == test_0) {
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (345)) COMMA_SOURCE_FILE_AT_LINE (345)).operator_concat (GALGAS_string (":  JSR with RCALL overflow, converted to JSR with CALL\n") COMMA_SOURCE_FILE_AT_LINE (345)) COMMA_SOURCE_FILE_AT_LINE (345)) ;
        ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
        GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_JSR::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabel, GALGAS_jumpInstructionKind::constructor_ipicAbsolute (SOURCE_FILE_AT_LINE (350)) COMMA_SOURCE_FILE_AT_LINE (347)) ;
        {
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (352)) ;
        }
      }
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: {
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_relative: {
      GALGAS_uint var_targetAddress ;
      constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (357)) ;
      GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (358)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (358)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (358)), inCompiler COMMA_SOURCE_FILE_AT_LINE (358)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (358)) ;
      const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (359)))) COMMA_SOURCE_FILE_AT_LINE (359)).boolEnum () ;
      if (kBoolTrue == test_1) {
        inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("displacement (").operator_concat (var_displacement.reader_string (SOURCE_FILE_AT_LINE (360)) COMMA_SOURCE_FILE_AT_LINE (360)).operator_concat (GALGAS_string (") too large for RCALL instruction (limited to [-1024, 1023])") COMMA_SOURCE_FILE_AT_LINE (360)) COMMA_SOURCE_FILE_AT_LINE (360)) ;
      }
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_absolute: {
      } break ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_JSR_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JSR_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_pseudo_LABEL checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                               const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                               GALGAS_uint & ioArgument_ioAddress,
                                                                                               GALGAS_bool & /* ioArgument_ioRelativeBranchOverflow */,
                                                                                               GALGAS_pic_31__38__5F_intermediate_5F_instructionList & /* ioArgument_ioGeneratedInstructionList */,
                                                                                               const GALGAS_uint /* constinArgument_inIndex */,
                                                                                               GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                               C_Compiler * inCompiler
                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
  GALGAS_uint var_targetAddress ;
  constinArgument_inRoutineSymbolTable.method_searchKey (object->mAttribute_mLabel, var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (377)) ;
  const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_targetAddress.objectCompare (ioArgument_ioAddress)).boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_location location_1 (object->mAttribute_mLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_1, GALGAS_string ("Internal second pass error: the '").operator_concat (object->mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (379)) COMMA_SOURCE_FILE_AT_LINE (379)).operator_concat (GALGAS_string ("' label gets ") COMMA_SOURCE_FILE_AT_LINE (380)).operator_concat (ioArgument_ioAddress.reader_hexString (SOURCE_FILE_AT_LINE (380)) COMMA_SOURCE_FILE_AT_LINE (380)).operator_concat (GALGAS_string (" value in second pass, while it gets ") COMMA_SOURCE_FILE_AT_LINE (380)).operator_concat (var_targetAddress.reader_hexString (SOURCE_FILE_AT_LINE (381)) COMMA_SOURCE_FILE_AT_LINE (381)).operator_concat (GALGAS_string (" in first pass") COMMA_SOURCE_FILE_AT_LINE (381)) COMMA_SOURCE_FILE_AT_LINE (379)) ;
  }
}
//---------------------------------------------------------------------------*

