pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_retlw checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                                                GALGAS_uint & ioArgument_ioAddress,
                                                                                                                GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                                                GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                                const GALGAS_uint constinArgument_inIndex,
                                                                                                                GALGAS_string & ioArgument_ioListFileContents,
                                                                                                                C_Compiler * inCompiler
                                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_uint var_targetAddress ;
    constinArgument_inRoutineSymbolTable.method_searchKey (GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_2"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (397)), var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (397)) ;
    GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (398)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (398)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (398)), inCompiler COMMA_SOURCE_FILE_AT_LINE (398)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (398)) ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (399)))) COMMA_SOURCE_FILE_AT_LINE (399)).boolEnum () ;
    if (kBoolTrue == test_1) {
      ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (401)) COMMA_SOURCE_FILE_AT_LINE (401)).operator_concat (GALGAS_string (":  COMPUTED RETLW with RCALL overflow, converted to COMPUTED RETLW with CALL\n") COMMA_SOURCE_FILE_AT_LINE (401)) COMMA_SOURCE_FILE_AT_LINE (401)) ;
      GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mLiteralValues, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (402)) ;
      {
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (407)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_bra checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

