pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                              const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                                              GALGAS_uint & ioArgument_ioAddress,
                                                                                                              GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                                              GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                              const GALGAS_uint constinArgument_inIndex,
                                                                                                              GALGAS_string & ioArgument_ioListFileContents,
                                                                                                              C_Compiler * inCompiler
                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_uint var_targetAddress ;
    constinArgument_inRoutineSymbolTable.method_searchKey (GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_2"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (424)), var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (424)) ;
    GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (425)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (425)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (425)), inCompiler COMMA_SOURCE_FILE_AT_LINE (425)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (425)) ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (426)))) COMMA_SOURCE_FILE_AT_LINE (426)).boolEnum () ;
    if (kBoolTrue == test_1) {
      ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (428)) COMMA_SOURCE_FILE_AT_LINE (428)).operator_concat (GALGAS_string (":  COMPUTED BRA with RCALL overflow, converted to COMPUTED BRA with CALL\n") COMMA_SOURCE_FILE_AT_LINE (428)) COMMA_SOURCE_FILE_AT_LINE (428)) ;
      GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabels, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (429)) ;
      {
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (434)) ;
      }
    }
  }
  GALGAS_uint var_addressForCheckingBRA = ioArgument_ioAddress.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (437)) ;
  const enumGalgasBool test_2 = object->mAttribute_mUsesRCALL.operator_not (SOURCE_FILE_AT_LINE (438)).boolEnum () ;
  if (kBoolTrue == test_2) {
    var_addressForCheckingBRA = var_addressForCheckingBRA.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (439)) ;
  }
  cEnumerator_lstringlist enumerator_18473 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_18473.hasCurrentObject ()) {
    GALGAS_uint var_targetAddress ;
    constinArgument_inRoutineSymbolTable.method_searchKey (enumerator_18473.current_mValue (HERE), var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (443)) ;
    GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (444)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (444)).substract_operation (var_addressForCheckingBRA.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (444)), inCompiler COMMA_SOURCE_FILE_AT_LINE (444)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (444)) ;
    const enumGalgasBool test_3 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (445)))) COMMA_SOURCE_FILE_AT_LINE (445)).boolEnum () ;
    if (kBoolTrue == test_3) {
      GALGAS_location location_4 (enumerator_18473.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_4, GALGAS_string ("displacement (").operator_concat (var_displacement.reader_string (SOURCE_FILE_AT_LINE (446)) COMMA_SOURCE_FILE_AT_LINE (446)).operator_concat (GALGAS_string (") too large for BRA instruction (limited to [-1024, 1023])") COMMA_SOURCE_FILE_AT_LINE (446)) COMMA_SOURCE_FILE_AT_LINE (446)) ;
    }
    var_addressForCheckingBRA = var_addressForCheckingBRA.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (448)) ;
    enumerator_18473.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

