pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_goto checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                               const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                                               GALGAS_uint & ioArgument_ioAddress,
                                                                                                               GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                                               GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                               const GALGAS_uint constinArgument_inIndex,
                                                                                                               GALGAS_string & ioArgument_ioListFileContents,
                                                                                                               C_Compiler * inCompiler
                                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_uint var_targetAddress ;
    constinArgument_inRoutineSymbolTable.method_searchKey (GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_4"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (464)), var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (464)) ;
    GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (465)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (465)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (465)), inCompiler COMMA_SOURCE_FILE_AT_LINE (465)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (465)) ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (466)))) COMMA_SOURCE_FILE_AT_LINE (466)).boolEnum () ;
    if (kBoolTrue == test_1) {
      ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (468)) COMMA_SOURCE_FILE_AT_LINE (468)).operator_concat (GALGAS_string (":  COMPUTED GOTO with RCALL overflow, converted to COMPUTED GOTO with CALL\n") COMMA_SOURCE_FILE_AT_LINE (468)) COMMA_SOURCE_FILE_AT_LINE (468)) ;
      GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabels, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (469)) ;
      {
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (474)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18_intermediate_instruction_computed_rcall checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument_inRoutineSymbolTable,
                                                                                                                GALGAS_uint & ioArgument_ioAddress,
                                                                                                                GALGAS_bool & ioArgument_ioRelativeBranchOverflow,
                                                                                                                GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                                const GALGAS_uint constinArgument_inIndex,
                                                                                                                GALGAS_string & ioArgument_ioListFileContents,
                                                                                                                C_Compiler * inCompiler
                                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    GALGAS_uint var_targetAddress ;
    constinArgument_inRoutineSymbolTable.method_searchKey (GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_4"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (494)), var_targetAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (494)) ;
    GALGAS_sint var_displacement = var_targetAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (495)).substract_operation (GALGAS_sint ((PMSInt32) 2L), inCompiler COMMA_SOURCE_FILE_AT_LINE (495)).substract_operation (ioArgument_ioAddress.reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (495)), inCompiler COMMA_SOURCE_FILE_AT_LINE (495)).right_shift_operation (GALGAS_uint ((PMUInt32) 1U) COMMA_SOURCE_FILE_AT_LINE (495)) ;
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1023L))).operator_or (GALGAS_bool (kIsStrictInf, var_displacement.objectCompare (GALGAS_sint ((PMSInt32) 1024L).operator_unary_minus (inCompiler COMMA_SOURCE_FILE_AT_LINE (496)))) COMMA_SOURCE_FILE_AT_LINE (496)).boolEnum () ;
    if (kBoolTrue == test_1) {
      ioArgument_ioRelativeBranchOverflow = GALGAS_bool (true) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inIndex.reader_string (SOURCE_FILE_AT_LINE (498)) COMMA_SOURCE_FILE_AT_LINE (498)).operator_concat (GALGAS_string (":  COMPUTED RCALL with RCALL overflow, converted to COMPUTED RCALL with CALL\n") COMMA_SOURCE_FILE_AT_LINE (498)) COMMA_SOURCE_FILE_AT_LINE (498)) ;
      GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction var_instruction = GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabels, object->mAttribute_mEndOfInstructionLabel, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (499)) ;
      {
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (var_instruction, constinArgument_inIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (505)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_checkRelativeBranch (void) {
  enterCategoryMethod_checkRelativeBranch (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_checkRelativeBranch) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_checkRelativeBranch (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_checkRelativeBranch, NULL) ;

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (void) :
mAttribute_lkey (),
mAttribute_mRoutineAddress () {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::~ GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (void) {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (const GALGAS_lstring & inOperand0,
                                                                                                                                                                        const GALGAS_uint & inOperand1) :
mAttribute_lkey (inOperand0),
mAttribute_mRoutineAddress (inOperand1) {
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::constructor_default (UNUSED_LOCATION_ARGS) {
  return GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (GALGAS_lstring::constructor_default (HERE),
                                                                                             GALGAS_uint::constructor_default (HERE)) ;
}

//---------------------------------------------------------------------------*

