pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.cpp
GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::constructor_new (const GALGAS_lstring & inOperand0,
                                                                                                                                                                                        const GALGAS_uint & inOperand1 
                                                                                                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element result ;
  if (inOperand0.isValid () && inOperand1.isValid ()) {
    result = GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (inOperand0, inOperand1) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_lkey.objectCompare (inOperand.mAttribute_lkey) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mRoutineAddress.objectCompare (inOperand.mAttribute_mRoutineAddress) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mRoutineAddress.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::drop (void) {
  mAttribute_lkey.drop () ;
  mAttribute_mRoutineAddress.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::description (C_String & ioString,
                                                                                                      const PMSInt32 inIndentation) const {
  ioString << "<struct @pic18_intermediate_symbolTableForConvertingRelatives.element:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_lkey.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mRoutineAddress.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::reader_lkey (UNUSED_LOCATION_ARGS) const {
  return mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::reader_mRoutineAddress (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mRoutineAddress ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//    @pic18_intermediate_symbolTableForConvertingRelatives.element type     *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element ("pic18_intermediate_symbolTableForConvertingRelatives.element",
                                                                                                    NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element::extractObject (const GALGAS_object & inObject,
                                                                                                                                                                                      C_Compiler * inCompiler
                                                                                                                                                                                      COMMA_LOCATION_ARGS) {
  GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element result ;
  const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element * p = (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element *> (p)) {
      result = *p ;
    }else{
      inCompiler->castError ("pic18_intermediate_symbolTableForConvertingRelatives.element", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


